Catalogs/ЗадачиПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостановкаЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоИсполнители</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьОтКонца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспеченоПрошлымиПериодами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеЮЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загрузка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гарантировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаРеализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гарантировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаРеализацииПоДоговорам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольныеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыПланаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыПланаБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прогноз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обеспечено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипСуммыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСуммыБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗадачиПроектов/Ext/ObjectModule.bsl
//Добавлено по задаче #131409 28.06.2018 Гумедин А.Г.
Процедура ПередЗаписью(Отказ, Замещение)
	
	//Находим совпадения наименования
	НайденныйОбъект = Справочники.ЗадачиПроектов.НайтиПоНаименованию(ЭтотОбъект.Наименование);
	
	//Проверяем на уникальность
	Если НЕ НайденныйОбъект.Пустая() И НЕ ЭтотОбъект.Ссылка = НайденныйОбъект.Ссылка Тогда
		Сообщить("Данное имя задачи не уникально!");
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры
//////////////////////////////////////////////////////

&НаСервере
Процедура ПроверкаСтатусаЗадач(Протокол) Экспорт
	//Протокол = Новый ТаблицаЗначений();
	//Протокол.Колонки.Добавить("Результат", Перечисления.СтатусыЗадачПроектов);
	//Протокол.Колонки.Добавить("Сообщение", Тип("Строка"));
	//Протокол.Колонки.Добавить("Задача", Справочники.ЗадачиПроектов);
	
	Ошибки = новый СписокЗначений();
	Предупреждения = новый СписокЗначений();
	
	//Отчет корректности данных [#129889]  
	ГодНачала = ?(Формат(НачалоРабот,"ДФ=гггг")="",0,Число(Формат(НачалоРабот,"ДФ=гггг")));
	ГодОкончания = ?(Формат(ОкончаниеРабот,"ДФ=гггг")="",0,Число(Формат(ОкончаниеРабот,"ДФ=гггг")));
		
	Если НЕ ГодЗадачи = ГодНачала Тогда 
		Ошибки.Добавить("Год начала работ не соотвествует году задачи");
	КонецЕсли;
	Если НЕ  ГодЗадачи = ГодОкончания Тогда
		Ошибки.Добавить("Год окончания работ не соотвествует году задачи");
	КонецЕсли;

	План = ЭтапыГрафикаРеализации.Итог("СуммаПлан");
	Если План <> Сумма Тогда 
		Ошибки.Добавить("Сумма задачи не распределена в графике реализации.");
	КонецЕсли;
	
	План = СуммаПоСметеЗадачиПроекта(Ссылка, Справочники.СтатьиСметы.ДохФинансовые);
	Если План <> 0 И План <> Сумма Тогда 
		Ошибки.Добавить("Сумма задачи не равна смете.");  
	КонецЕсли;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВидПлана", Перечисления.ВидыПланаБюджета.Гарантия);
	Отбор.Вставить("ВидПлана", Перечисления.ВидыПланаБюджета.Прогноз);
	этапы = ЭтапыГрафикаРеализации.НайтиСтроки(Отбор);
	Для Каждого этап из этапы Цикл 
		Если этап.ДатаРеализации < НачалоМесяца(ТекущаяДата()) Тогда 
			Ошибки.Добавить("Дата " + этап.ДатаРеализации + " графика реализации (" + этап.ВидПлана + ") меньше текущей даты.");  
		КонецЕсли;
	КонецЦикла;		

	ГрафикРеализации = ГрафикРеализацииЗадачиДоговорам(Ссылка);
	ГрафикРеализации.Свернуть("ВидПлана","СуммаПлан");
	
	Для Каждого график Из ГрафикРеализации Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("ВидПлана", график.ВидПлана);
		этапы = ЭтапыГрафикаРеализации.НайтиСтроки(Отбор);
		
		сумма = 0;
		Для Каждого этап из этапы Цикл 
			сумма = сумма + этап.СуммаПлан;
		КонецЦикла;		
		
		//Добавлены условия по задаче #131869 13.07.2018 Гумедин А.Г.
		
		МодульСуммы = ?(сумма-график.СуммаПлан > 0, сумма-график.СуммаПлан, -(сумма-график.СуммаПлан));
		
		Если МодульСуммы >= 1 Тогда 
			Ошибки.Добавить("Сумма по графику реализации задачи (" + график.ВидПлана + ") не соответствует графику реализации обеспечения.");  
		КонецЕсли;
		
		сумма = УП_СметаПроекта.ПолучитьОборотБюджетаПоСтатье(Справочники.СтатьиСметы.ДохФинансовые, 
			Владелец.Ссылка, Ссылка, Перечисления.ТипСуммыБюджета.План, график.ВидПлана);
			
		МодульСуммы = ?(сумма-график.СуммаПлан > 0, сумма-график.СуммаПлан, -(сумма-график.СуммаПлан));	
			
		Если МодульСуммы >= 1 Тогда 
			Ошибки.Добавить("Сумма по графику реализации задачи (" + график.ВидПлана + ") не соответствует бюджету (смете).");  
		КонецЕсли;
		//////////////////////////////////////////////////////////
	КонецЦикла;	
	
	//Добавлено по задаче #132237 25.07.2018 Гумедин А.Г.
	ПроверкаКонтрольныхСуммФакта(Ошибки);
	
	Для Каждого ошибка Из Ошибки Цикл 
		запись = Протокол.Добавить();
		запись.Результат = Перечисления.СтатусыЗадачПроектов.Ошибки;
		запись.Сообщение = ошибка;
		запись.Задача = Ссылка;
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда 
		Статус = Перечисления.СтатусыЗадачПроектов.Ошибки;
	Иначе 
		Статус = Перечисления.СтатусыЗадачПроектов.Корректный;
	КонецЕсли;
	
	СтатусДата = ТекущаяДата();
	Записать();	
КонецПроцедуры

//Добавлено по задаче #132237 25.07.2018 Гумедин А.Г.
//Функция проверки контрольных сумм по факту           
&НаСервере
Процедура ПроверкаКонтрольныхСуммФакта(Ошибки)
	
	СуммыПоСтатьям = Новый СписокЗначений;	
	Результат = Ложь;

	//Получим все суммы
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетПоМесяцам.СтатьяСметы.Код КАК СтатьяСметы,
		|	СУММА(БюджетПоМесяцам.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
		|ГДЕ
		|	БюджетПоМесяцам.ТипСуммы.Порядок = 2
		|	И БюджетПоМесяцам.ЗадачаПроекта = &ЗадачаПроекта
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцам.СтатьяСметы.Код,
		|	БюджетПоМесяцам.ЗадачаПроекта
		|
		|УПОРЯДОЧИТЬ ПО
		|	БюджетПоМесяцам.ЗадачаПроекта";
	
	Запрос.УстановитьПараметр("ЗадачаПроекта", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 	 	
		СуммыПоСтатьям.Добавить(ВыборкаДетальныеЗаписи.СтатьяСметы, Число(ВыборкаДетальныеЗаписи.Сумма)); 	
	КонецЦикла;
	
	Ст1 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000006")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000006").Представление));
	Ст1_1 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000007")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000007").Представление));
	Ст1_2 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000002")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000002").Представление));
	Ст1_3 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000010")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000010").Представление));
	Ст2 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000008")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000008").Представление));
	Ст2_1 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000009")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000009").Представление));
	Ст2_2 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000005")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000005").Представление));
	Ст3 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000021")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000021").Представление));
	Ст4 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000016")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000016").Представление));
	Ст5 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000011")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000011").Представление));
	Ст5_1 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000003")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000003").Представление));
	Ст5_2 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000013")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000013").Представление));
	Ст6 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000017")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000017").Представление));
	Ст6_1 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000020")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000020").Представление));
	Ст6_2 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000035")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000035").Представление));
	Ст6_3 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000015")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000015").Представление));
	Ст6_4 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000012")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000012").Представление));
	Ст6_5 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000034")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000034").Представление));
	Ст7 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000023")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000023").Представление));
	Ст9 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000028")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000028").Представление));
	Ст9_1 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000025")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000025").Представление));
	Ст9_2 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000029")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000029").Представление));
	Ст10 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000030")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000030").Представление));
	Ст10_1 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000031")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000031").Представление));
	Ст10_2 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000032")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000032").Представление));
	Ст11 = ?(СуммыПоСтатьям.НайтиПоЗначению("000000001")=Неопределено,0,Число(СуммыПоСтатьям.НайтиПоЗначению("000000001").Представление));
	
	///////	Доходы финансовые
	Если НЕ Ст1 = (Ст1_1+Ст1_2+Ст1_3) Тогда
			Ошибки.Добавить("Контрольная сумма по статье  'Доходы финансовые' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	///////	Доходы вычитаемые
	Если НЕ Ст2 = (Ст2_1+Ст2_2) Тогда
			Ошибки.Добавить("Контрольная сумма по статье  'Доходы вычитаемые' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	/////// ЧИСТЫЙ ДОХОД
	Если НЕ Ст3 = (Ст1-Ст2) Тогда
			Ошибки.Добавить("Контрольная сумма по статье  'ЧИСТЫЙ ДОХОД' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	/////// Коммерческие расходы по проекту
	Если НЕ Ст5 = (Ст5_1+Ст5_2) Тогда
		Ошибки.Добавить("Контрольная сумма по статье  'Коммерческие расходы по проекту' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	/////// Прямые производственные расходы
	Если НЕ Ст6 = (Ст6_1+Ст6_2+Ст6_3+Ст6_4+Ст6_5) Тогда
		Ошибки.Добавить("Контрольная сумма по статье  'Прямые производственные расходы' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	///////	ДОХОД ОТ РЕАЛИЗАЦИИ
	Если НЕ Ст7 = (Ст3-Ст4-Ст5-Ст6) Тогда
		Ошибки.Добавить("Контрольная сумма по статье  'ДОХОД ОТ РЕАЛИЗАЦИИ' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	/////// Фонд директора проекта
	Если НЕ Ст9 = (Ст9_1+Ст9_2) Тогда
		Ошибки.Добавить("Контрольная сумма по статье  'Фонд директора проекта' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	/////// Фонд клиент менеджера
	Если НЕ Ст10 = (Ст10_1+Ст10_2) Тогда
		Ошибки.Добавить("Контрольная сумма по статье  'Фонд клиент менеджера' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	/////// ВАЛОВЫЙ ДОХОД
	Если НЕ Ст11 = (Ст7-Ст9-Ст10) Тогда
		Ошибки.Добавить("Контрольная сумма по статье  'ВАЛОВЫЙ ДОХОД' задачи '" + Наименование + "' не прошла проверку.");
	КонецЕсли;
	
	//Возврат Результат;		
КонецПроцедуры
